[
  {
    "course_name": "Node.js, Express, MongoDB và hơn thế nữa: Bootcamp hoàn chỉnh 2024",
    "course_type": "Web Devlopment",
    "course_description": "Bạn có muốn xây dựng các ứng dụng back-end nhanh và mạnh mẽ bằng JavaScript không? Bạn có muốn trở thành một nhà phát triển hoàn thiện hơn và có nhu cầu cao hơn không? Vậy thì Node.js là công nghệ hấp dẫn để bạn học ngay bây giờ và bạn đã đến đúng nơi để học điều đó! Chào mừng bạn đến với Complete Node.js, Express và MongoDB Bootcamp, con đường nhanh chóng để bạn phát triển back-end hiện đại.",
    "course_thumnail": "https://d3vtabhqvgxulr.cloudfront.net/Images/8210337e169eed23118c8d9bed28981c.png",
    "course_demoVideo": "https://d3vtabhqvgxulr.cloudfront.net/Video/d7318c51aa6c6e7bb5a7a38067b9af98.mp4",
    "course_benefits": [
      "Đang xây dựng các ứng dụng web hoặc API RESTful Node.js nhanh, có thể mở rộng và mạnh mẽ của riêng bạn;",
      "Thực sự hiểu cách Node.js hoạt động ở backend;"
    ],
    "course_lessonContent": [
      "Nắm vững toàn bộ back-end hiện đại: Node, Express, MongoDB và Mongoose (trình điều khiển MongoDB JS)",
      "Xây dựng API RESTful nhanh, có thể mở rộng, giàu tính năng (bao gồm các bộ lọc, sắp xếp, phân trang và hơn thế nữa)",
      "Hoạt động CRUD với MongoDB và Mongoose"
    ],
    "course_price": 1000000
  },

  {
    "course_name": "Design Patterns in JavaScript",
    "course_type": "bốc id danh mục bỏ vô",
    "course_description": "Mẫu thiết kế là giải pháp có thể tái sử dụng cho các vấn đề lập trình phổ biến. Chúng được phổ biến rộng rãi với cuốn sách năm 1994  Các mẫu thiết kế: Các yếu tố của phần mềm hướng đối tượng có thể tái sử dụng  của  Erich Gamma, John Vlissides, Ralph Johnson và Richard Helm  (những người thường được gọi là Gang of Four, do đó là từ viết tắt của GoF).Cuốn sách gốc của GoF đã sử dụng C++ và Smalltalk làm ví dụ, nhưng kể từ đó, các mẫu thiết kế đã được điều chỉnh cho phù hợp với mọi ngôn ngữ lập trình có thể tưởng tượng được: C#, Java, Swift, Python và bây giờ - JavaScript!Sức hấp dẫn của các mẫu thiết kế là bất diệt: chúng ta thấy chúng trong các thư viện, một số trong số chúng có sẵn trong các ngôn ngữ lập trình và bạn có thể sử dụng chúng hàng ngày ngay cả khi bạn không nhận ra chúng ở đó.",
    "course_thumnail": "https://d3vtabhqvgxulr.cloudfront.net/Images/3c5237c471ec4f60ee028e34b74524b1.png",
    "course_demoVideo": "https://d3vtabhqvgxulr.cloudfront.net/Video/1c3f3f1231d892b18236bb9f12f626cb.mp4",
    "course_benefits": [
      "Thành thạo các mẫu patterns",
      "Biết cách áp dụng các mẫu patterns vào thực thế"
    ],
    "course_lessonContent": [
      "Nhận biết và áp dụng các mẫu thiết kế",
      "Lý do về khả năng ứng dụng và khả năng sử dụng của các mẫu thiết kế",
      "Tái cấu trúc các thiết kế hiện có để sử dụng các mẫu thiết kế"
    ],
    "course_price": 1200000
  }
]
